<template>
  <section>
    <span class="ma-10 mb-10 d-block">Данный проект является примером приложения nuxt для знакомства с технологий и сбора разных понравившихся фотографий через URL, фотографии сохраняются в indexedBD - в бдшке на фронте, где фотографии хранятся как ключ-значение без участия бека и типовых БД. И при обновлении если в БД есть данные, то они вытаскиваются оттуда при монтировании компонента галереи. Добавляйте фотографии и пополняйте свою галерею совершенно бесплатно!</span>
  </section>
</template>

<script lang="ts" setup>
</script>

<style lang="scss" scoped>
section {
  text-align: center;
  //padding: 2rem;

  span {
    font-size: 30px;
  }
}
</style>